stawel/cheali-charger/src/hardware/nuvoton-NUC029/cpu/CMSIS/Device/Nuvoton/NUC029xAN/Include/NUC029xAN.h
    /**
     * STATUS
     * ===================================================================================================
     * Offset: 0x44  SPI Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |RX_INTSTS |Receive FIFO Threshold Interrupt Status (read only)
     * |        |          |1 = It indicates that the valid data count within the receive FIFO buffer is larger than the setting value of RX_THRESHOLD.
     * |        |          |0 = It indicates that the valid data count within the Rx FIFO buffer is smaller than or equal to the setting value of RX_THRESHOLD.
     * |        |          |Note: If RX_INTEN = 1 and RX_INTSTS = 1, the SPI controller will generate a SPI interrupt request.
     * |[2]     |RX_OVERRUN|Receive FIFO Overrun Status
     * |        |          |When the receive FIFO buffer is full, the follow-up data will be dropped and this bit will be set to 1.
     * |        |          |Note: This bit will be cleared by writing 1 to itself.
     * |[4]     |TX_INTSTS |Transmit FIFO Threshold Interrupt Status (read only)
     * |        |          |1 = It indicates that the valid data count within the transmit FIFO buffer is less than or equal to the setting value of TX_THRESHOLD.
     * |        |          |0 = It indicates that the valid data count within the transmit FIFO buffer is larger than the setting value of TX_THRESHOLD.
     * |        |          |Note: If TX_INTEN = 1 and TX_INTSTS = 1, the SPI controller will generate a SPI interrupt request.
     * |[11]    |SLV_START_INTSTS|Slave Start Interrupt Status
     * |        |          |It is used to dedicate that the transfer has started in slave 3-wire mode. It's a mutual mirror bit of SPI_CNTRL2[11].
     * |        |          |1 = It indicates that the transfer has started in slave 3-wire mode. It will be cleared as transfer done or by writing one to this bit.
     * |        |          |0 = It indicates that the transfer is not started.
     * |[15:12] |RX_FIFO_COUNT   |Receive FIFO Data Count (read only)
     * |        |          |Indicates the valid data count of receive FIFO buffer.
     * |[16]    |IF        |SPI Unit Transfer Interrupt Flag
     * |        |          |It's a mutual mirror bit of SPI_CNTRL[16].
     * |        |          |1 = It indicates that the SPI controller has finished one unit transfer.
     * |        |          |0 = It indicates that the transfer does not finish yet.
     * |        |          |Note: This bit will be cleared by writing 1 to itself.
     * |[20]    |TIMEOUT   |Time-out Interrupt Flag
     * |        |          |1 = It indicates that the receive FIFO buffer is not empty and there is not be read over 64 SPI clock period in master mode and over 576 SPI engine clock period in slave mode. When the received FIFO buffer is read by software, the time-out status will be cleared automatically.
     * |        |          |0 = No receive FIFO time-out event.
     * |        |          |Note: This bit will be cleared by writing 1 to itself.
     * |[24]    |RX_EMPTY  |Receive FIFO Buffer Empty Indicator (read only)
     * |        |          |It's a mutual mirror bit of SPI_CNTRL[24].
     * |        |          |1 = Indicates that the receive FIFO buffer is empty
     * |        |          |0 = Indicates that the receive FIFO buffer is not empty
     * |[25]    |RX_FULL   |Receive FIFO Buffer Full Indicator (read only)
     * |        |          |It's a mutual mirror bit of SPI_CNTRL[25].
     * |        |          |1 = Indicates that the receive FIFO buffer is full
     * |        |          |0 = Indicates that the receive FIFO buffer is not full
     * |[26]    |TX_EMPTY  |Transmit FIFO Buffer Empty Indicator (read only)
     * |        |          |It's a mutual mirror bit of SPI_CNTRL[26].
     * |        |          |1 = Indicates that the transmit FIFO buffer is empty
     * |        |          |0 = Indicates that the transmit FIFO buffer is not empty
     * |[27]    |TX_FULL   |Transmit FIFO Buffer Full Indicator (read only)
     * |        |          |It's a mutual mirror bit of SPI_CNTRL[27].
     * |        |          |1 = Indicates that the transmit FIFO buffer is full
     * |        |          |0 = Indicates that the transmit FIFO buffer is not full
     * |[31:28] |TX_FIFO_COUNT   |Transmit FIFO Data Count (read only)
     * |        |          |Indicates the valid data count of transmit FIFO buffer.
     */
    __IO uint32_t STATUS;

} SPI_T;

/** @addtogroup SPI_CONST SPI Bit Field Definition
  Constant Definitions for SPI Controller
  @{
 */

/* SPI_CNTRL Bit Field Definitions */
#define SPI_CNTRL_TX_FULL_Pos      27                                     /*!< SPI CNTRL: TX_FULL Position */
#define SPI_CNTRL_TX_FULL_Msk      (1ul << SPI_CNTRL_TX_FULL_Pos)         /*!< SPI CNTRL: TX_FULL Mask     */

#define SPI_CNTRL_TX_EMPTY_Pos     26                                     /*!< SPI CNTRL: TX_EMPTY Position */
#define SPI_CNTRL_TX_EMPTY_Msk     (1ul << SPI_CNTRL_TX_EMPTY_Pos)        /*!< SPI CNTRL: TX_EMPTY Mask     */

#define SPI_CNTRL_RX_FULL_Pos      25                                     /*!< SPI CNTRL: RX_FULL Position */
#define SPI_CNTRL_RX_FULL_Msk      (1ul << SPI_CNTRL_RX_FULL_Pos)         /*!< SPI CNTRL: RX_FULL Mask     */

#define SPI_CNTRL_RX_EMPTY_Pos     24                                     /*!< SPI CNTRL: RX_EMPTY Position */
#define SPI_CNTRL_RX_EMPTY_Msk     (1ul << SPI_CNTRL_RX_EMPTY_Pos)        /*!< SPI CNTRL: RX_EMPTY Mask     */

#define SPI_CNTRL_FIFO_Pos         21                                     /*!< SPI CNTRL: FIFO Position */
#define SPI_CNTRL_FIFO_Msk         (1ul << SPI_CNTRL_FIFO_Pos)            /*!< SPI CNTRL: FIFO Mask     */

#define SPI_CNTRL_REORDER_Pos      19                                     /*!< SPI CNTRL: REORDER Position */
#define SPI_CNTRL_REORDER_Msk      (3ul << SPI_CNTRL_REORDER_Pos)         /*!< SPI CNTRL: REORDER Mask     */

